#### IsNotEmpty Method

---

|  |
| --- |
| DisplacementElement Class   See Also |

Validates that the input set of element ids is valid for a DisplacementElement.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static bool IsNotEmpty( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsNotEmpty ( _ 	elementIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsNotEmpty( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     A set of element ids.

#### Return Value

True if the set of element ids is not empty.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DisplacementElement Class

Autodesk.Revit.DB Namespace